In [1]:
import pandas as pd
d = {'Name':['Newton', 'Galilei', 'Einstein', 'Feynman', 
             'Newton', 'Maxwell', 'Galilei'],
     'Age':[26, 30, 28, 28, 26, 39, 40],
     'Score':[90, 80, 90, 100, 90, 70, 90]}
df = pd.DataFrame(d,columns=['Name','Age','Score'])
df

       Name  Age  Score
0    Newton   26     90
1   Galilei   30     80
2  Einstein   28     90
3   Feynman   28    100
4    Newton   26     90
5   Maxwell   39     70
6   Galilei   40     90

In [2]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [3]:
df.duplicated?

In [4]:
df.duplicated('Age', keep='last')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool

In [5]:
df.duplicated(['Age', 'Score'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [6]:
df[df.duplicated()].count() / df.count()

Name     0.142857
Age      0.142857
Score    0.142857
dtype: float64

In [7]:
df.duplicated().any()

True

In [8]:
df.drop_duplicates()

       Name  Age  Score
0    Newton   26     90
1   Galilei   30     80
2  Einstein   28     90
3   Feynman   28    100
5   Maxwell   39     70
6   Galilei   40     90

In [9]:
df.drop_duplicates('Age', keep='last')

      Name  Age  Score
1  Galilei   30     80
3  Feynman   28    100
4   Newton   26     90
5  Maxwell   39     70
6  Galilei   40     90